---
kind: type
id: T:Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally
source: html/78055133-73c1-eac8-fbc2-2197ffe9d6a5.htm
---
# Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally

Class giving options when saving linked files which are unloaded locally and have been modified
 in-memory by shared coordinates operations.

## Syntax (C#)
```csharp
public enum SaveModifiedLinksOptionsForUnloadLocally
```